parsercombinators/parsercombinators.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>Parser Combinators</title>
<meta name="author" content="Alberto"/>
<link rel="stylesheet" href="/Users/alberto/.emacs.d/.local/straight/build-28.1/revealjs/dist/reveal.css"/>

<link rel="stylesheet" href="/Users/alberto/.emacs.d/.local/straight/build-28.1/revealjs/dist/theme/moon.css" id="theme"/>
</head>
<body>
<div class="reveal">
<div class="slides">
<section id="sec-title-slide">
<h1 class="title">Parser Combinators</h1>
</section>


<section>
<section id="slide-1">
<h2 id="1"><span class="section-number-2">1.</span> Combinators</h2>
<div class="outline-text-2" id="text-1">
</div>
</section>
<section id="slide-1-1">
<h3 id="1-1"><span class="section-number-3">1.1.</span> Functions</h3>
<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #51afef;">class</span> <span style="color: #ECBE7B;">IsMatch</span> a <span style="color: #51afef;">where</span>
  is      <span style="color: #dcaeea;">::</span> a <span style="color: #dcaeea;">-&gt;</span> <span style="color: #ECBE7B;">Parser</span> a
  isNot   <span style="color: #dcaeea;">::</span> a <span style="color: #dcaeea;">-&gt;</span> <span style="color: #ECBE7B;">Parser</span> a
  inverse <span style="color: #dcaeea;">::</span> <span style="color: #ECBE7B;">Parser</span> a <span style="color: #dcaeea;">-&gt;</span> <span style="color: #ECBE7B;">Parser</span> a
  oneOf   <span style="color: #dcaeea;">::</span> [a] <span style="color: #dcaeea;">-&gt;</span> <span style="color: #ECBE7B;">Parser</span> a
  noneOf  <span style="color: #dcaeea;">::</span> [a] <span style="color: #dcaeea;">-&gt;</span> <span style="color: #ECBE7B;">Parser</span> a

  <span style="color: #51afef;">instance</span>   <span style="color: #ECBE7B;">IsMatch</span> <span style="color: #ECBE7B;">Char</span>
  <span style="color: #51afef;">instance</span>   <span style="color: #ECBE7B;">IsMatch</span> <span style="color: #ECBE7B;">String</span>
  <span style="color: #51afef;">instance</span>   (<span style="color: #ECBE7B;">Num</span> a) <span style="color: #dcaeea;">=&gt;</span> <span style="color: #ECBE7B;">IsMatch</span> a
</pre>
</div>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #c678dd;">within</span> <span style="color: #dcaeea;">::</span> <span style="color: #ECBE7B;">Parser</span> a <span style="color: #dcaeea;">-&gt;</span> <span style="color: #ECBE7B;">Parser</span> b <span style="color: #dcaeea;">-&gt;</span> <span style="color: #ECBE7B;">Parser</span> b

<span style="color: #c678dd;">withinBoth</span> <span style="color: #dcaeea;">::</span> <span style="color: #ECBE7B;">Parser</span> a <span style="color: #dcaeea;">-&gt;</span> <span style="color: #ECBE7B;">Parser</span> b <span style="color: #dcaeea;">-&gt;</span> <span style="color: #ECBE7B;">Parser</span> c <span style="color: #dcaeea;">-&gt;</span> <span style="color: #ECBE7B;">Parser</span> c

<span style="color: #c678dd;">anySepBy</span> <span style="color: #dcaeea;">::</span> <span style="color: #ECBE7B;">Parser</span> a <span style="color: #dcaeea;">-&gt;</span> <span style="color: #ECBE7B;">Parser</span> b <span style="color: #dcaeea;">-&gt;</span> <span style="color: #ECBE7B;">Parser</span> [b]

<span style="color: #c678dd;">someSepBy</span> <span style="color: #dcaeea;">::</span> <span style="color: #ECBE7B;">Parser</span> a <span style="color: #dcaeea;">-&gt;</span> <span style="color: #ECBE7B;">Parser</span> b <span style="color: #dcaeea;">-&gt;</span> <span style="color: #ECBE7B;">Parser</span> [b]

<span style="color: #c678dd;">manySepBy</span> <span style="color: #dcaeea;">::</span> <span style="color: #ECBE7B;">Parser</span> a <span style="color: #dcaeea;">-&gt;</span> <span style="color: #ECBE7B;">Parser</span> b <span style="color: #dcaeea;">-&gt;</span> <span style="color: #ECBE7B;">Parser</span> [b]
</pre>
</div>


</section>
<section id="slide-1-2">
<h3 id="1-2"><span class="section-number-3">1.2.</span> Operators</h3>
<div class="org-src-container">

<pre class="src src-haskell">(<span style="color: #c678dd;">&lt;|&gt;</span>) <span style="color: #dcaeea;">::</span> <span style="color: #ECBE7B;">Parser</span> a <span style="color: #dcaeea;">-&gt;</span> <span style="color: #ECBE7B;">Parser</span> a <span style="color: #dcaeea;">-&gt;</span> <span style="color: #ECBE7B;">Parser</span> a

(<span style="color: #c678dd;">&lt;#&gt;</span>) <span style="color: #dcaeea;">::</span> <span style="color: #ECBE7B;">Parser</span> a <span style="color: #dcaeea;">-&gt;</span> <span style="color: #ECBE7B;">Integer</span> <span style="color: #dcaeea;">-&gt;</span> <span style="color: #ECBE7B;">Parser</span> [a]
</pre>
</div>


<div class="org-src-container">

<pre class="src src-haskell">(<span style="color: #c678dd;">|?</span>) <span style="color: #dcaeea;">::</span> <span style="color: #ECBE7B;">Parser</span> a <span style="color: #dcaeea;">-&gt;</span> <span style="color: #ECBE7B;">Parser</span> (<span style="color: #ECBE7B;">Maybe</span> a)
(<span style="color: #c678dd;">|?</span>) <span style="color: #dcaeea;">=</span> maybeTimes

(<span style="color: #c678dd;">|*</span>) <span style="color: #dcaeea;">::</span> <span style="color: #ECBE7B;">Parser</span> a <span style="color: #dcaeea;">-&gt;</span> <span style="color: #ECBE7B;">Parser</span> [a]
(<span style="color: #c678dd;">|*</span>) <span style="color: #dcaeea;">=</span> anyTimes

(<span style="color: #c678dd;">|+</span>) <span style="color: #dcaeea;">::</span> <span style="color: #ECBE7B;">Parser</span> a <span style="color: #dcaeea;">-&gt;</span> <span style="color: #ECBE7B;">Parser</span> [a]
(<span style="color: #c678dd;">|+</span>) <span style="color: #dcaeea;">=</span> someTimes

(<span style="color: #c678dd;">|++</span>) <span style="color: #dcaeea;">::</span> <span style="color: #ECBE7B;">Parser</span> a <span style="color: #dcaeea;">-&gt;</span> <span style="color: #ECBE7B;">Parser</span> [a]
(<span style="color: #c678dd;">|++</span>) <span style="color: #dcaeea;">=</span> manyTimes
</pre>
</div>


</section>
</section>
<section>
<section id="slide-2">
<h2 id="2"><span class="section-number-2">2.</span> Primitive parsers</h2>
<div class="outline-text-2" id="text-2">
</div>
</section>
<section id="slide-2-1">
<h3 id="2-1"><span class="section-number-3">2.1.</span> Chars</h3>
<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #c678dd;">char</span> <span style="color: #dcaeea;">::</span> <span style="color: #ECBE7B;">Parser</span> <span style="color: #ECBE7B;">Char</span>
<span style="color: #c678dd;">char</span> <span style="color: #dcaeea;">=</span> Parser.char

<span style="color: #c678dd;">digit</span> <span style="color: #dcaeea;">::</span> <span style="color: #ECBE7B;">Parser</span> <span style="color: #ECBE7B;">Char</span>
<span style="color: #c678dd;">digit</span> <span style="color: #dcaeea;">=</span> oneOf [<span style="color: #98be65;">'0'</span> <span style="color: #dcaeea;">..</span> <span style="color: #98be65;">'9'</span>]

<span style="color: #c678dd;">upper</span> <span style="color: #dcaeea;">::</span> <span style="color: #ECBE7B;">Parser</span> <span style="color: #ECBE7B;">Char</span>
<span style="color: #c678dd;">upper</span> <span style="color: #dcaeea;">=</span> oneOf [<span style="color: #98be65;">'A'</span> <span style="color: #dcaeea;">..</span> <span style="color: #98be65;">'Z'</span>]

<span style="color: #c678dd;">lower</span> <span style="color: #dcaeea;">::</span> <span style="color: #ECBE7B;">Parser</span> <span style="color: #ECBE7B;">Char</span>
<span style="color: #c678dd;">lower</span> <span style="color: #dcaeea;">=</span> oneOf [<span style="color: #98be65;">'a'</span> <span style="color: #dcaeea;">..</span> <span style="color: #98be65;">'z'</span>]

<span style="color: #c678dd;">letter</span> <span style="color: #dcaeea;">::</span> <span style="color: #ECBE7B;">Parser</span> <span style="color: #ECBE7B;">Char</span>
<span style="color: #c678dd;">letter</span> <span style="color: #dcaeea;">=</span> upper <span style="color: #dcaeea;">&lt;|&gt;</span> lower

<span style="color: #c678dd;">alphaNum</span> <span style="color: #dcaeea;">::</span> <span style="color: #ECBE7B;">Parser</span> <span style="color: #ECBE7B;">Char</span>
<span style="color: #c678dd;">alphaNum</span> <span style="color: #dcaeea;">=</span> letter <span style="color: #dcaeea;">&lt;|&gt;</span> digit
</pre>
</div>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #c678dd;">space</span> <span style="color: #dcaeea;">::</span> <span style="color: #ECBE7B;">Parser</span> <span style="color: #ECBE7B;">Char</span>
<span style="color: #c678dd;">space</span> <span style="color: #dcaeea;">=</span> is <span style="color: #98be65;">' '</span>

<span style="color: #c678dd;">tab</span> <span style="color: #dcaeea;">::</span> <span style="color: #ECBE7B;">Parser</span> <span style="color: #ECBE7B;">Char</span>
<span style="color: #c678dd;">tab</span> <span style="color: #dcaeea;">=</span> is <span style="color: #98be65;">'\t'</span>
</pre>
</div>

</section>
<section id="slide-2-2">
<h3 id="2-2"><span class="section-number-3">2.2.</span> Strings</h3>
<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #c678dd;">string</span> <span style="color: #dcaeea;">::</span> <span style="color: #ECBE7B;">Parser</span> <span style="color: #ECBE7B;">String</span>
<span style="color: #c678dd;">string</span> <span style="color: #dcaeea;">=</span> (char <span style="color: #dcaeea;">|*</span>)

<span style="color: #c678dd;">word</span> <span style="color: #dcaeea;">::</span> <span style="color: #ECBE7B;">Parser</span> <span style="color: #ECBE7B;">String</span>
<span style="color: #c678dd;">word</span> <span style="color: #dcaeea;">=</span> (inverse whiteSpace <span style="color: #dcaeea;">|+</span>)

<span style="color: #c678dd;">digits</span> <span style="color: #dcaeea;">::</span> <span style="color: #ECBE7B;">Parser</span> <span style="color: #ECBE7B;">String</span>
<span style="color: #c678dd;">digits</span> <span style="color: #dcaeea;">=</span> (digit <span style="color: #dcaeea;">|+</span>)

<span style="color: #c678dd;">uppers</span> <span style="color: #dcaeea;">::</span> <span style="color: #ECBE7B;">Parser</span> <span style="color: #ECBE7B;">String</span>
<span style="color: #c678dd;">uppers</span> <span style="color: #dcaeea;">=</span> (upper <span style="color: #dcaeea;">|+</span>)

<span style="color: #c678dd;">lowers</span> <span style="color: #dcaeea;">::</span> <span style="color: #ECBE7B;">Parser</span> <span style="color: #ECBE7B;">String</span>
<span style="color: #c678dd;">lowers</span> <span style="color: #dcaeea;">=</span> (lower <span style="color: #dcaeea;">|+</span>)
</pre>
</div>


<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #c678dd;">withinQuotes</span> <span style="color: #dcaeea;">::</span> <span style="color: #ECBE7B;">Parser</span> b <span style="color: #dcaeea;">-&gt;</span> <span style="color: #ECBE7B;">Parser</span> b
<span style="color: #c678dd;">withinQuotes</span> <span style="color: #dcaeea;">=</span> within quote

<span style="color: #c678dd;">withinDoubleQuotes</span> <span style="color: #dcaeea;">::</span> <span style="color: #ECBE7B;">Parser</span> b <span style="color: #dcaeea;">-&gt;</span> <span style="color: #ECBE7B;">Parser</span> b
<span style="color: #c678dd;">withinDoubleQuotes</span> <span style="color: #dcaeea;">=</span> within doubleQuote
</pre>
</div>

</section>
<section id="slide-2-3">
<h3 id="2-3"><span class="section-number-3">2.3.</span> Date Components</h3>
<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #c678dd;">range</span> <span style="color: #dcaeea;">::</span> <span style="color: #ECBE7B;">Ord</span> a <span style="color: #dcaeea;">=&gt;</span> a <span style="color: #dcaeea;">-&gt;</span> a <span style="color: #dcaeea;">-&gt;</span> a <span style="color: #dcaeea;">-&gt;</span> <span style="color: #ECBE7B;">Bool</span>
<span style="color: #c678dd;">range</span> mn mx x <span style="color: #dcaeea;">=</span> x <span style="color: #dcaeea;">&gt;=</span> mn <span style="color: #dcaeea;">&amp;&amp;</span> x <span style="color: #dcaeea;">&lt;=</span> mx

<span style="color: #c678dd;">year</span> <span style="color: #dcaeea;">::</span> <span style="color: #ECBE7B;">Parser</span> <span style="color: #ECBE7B;">Integer</span>
<span style="color: #c678dd;">year</span> <span style="color: #dcaeea;">=</span> digit <span style="color: #dcaeea;">&lt;#&gt;</span> <span style="color: #da8548; font-weight: bold;">4</span>

<span style="color: #c678dd;">day</span> <span style="color: #dcaeea;">::</span> <span style="color: #ECBE7B;">Parser</span> <span style="color: #ECBE7B;">Int</span>
<span style="color: #c678dd;">day</span> <span style="color: #dcaeea;">=</span> check <span style="color: #98be65;">"Day"</span> (range <span style="color: #da8548; font-weight: bold;">1</span> <span style="color: #da8548; font-weight: bold;">31</span>) <span style="color: #dcaeea;">$</span> digit <span style="color: #dcaeea;">&lt;#&gt;</span> <span style="color: #da8548; font-weight: bold;">2</span>

<span style="color: #c678dd;">month</span> <span style="color: #dcaeea;">::</span> <span style="color: #ECBE7B;">Parser</span> <span style="color: #ECBE7B;">Int</span>
<span style="color: #c678dd;">month</span> <span style="color: #dcaeea;">=</span> check <span style="color: #98be65;">"Month"</span> (range <span style="color: #da8548; font-weight: bold;">1</span> <span style="color: #da8548; font-weight: bold;">12</span>) <span style="color: #dcaeea;">$</span> digit <span style="color: #dcaeea;">&lt;#&gt;</span> <span style="color: #da8548; font-weight: bold;">2</span>

<span style="color: #c678dd;">hour</span> <span style="color: #dcaeea;">::</span> <span style="color: #ECBE7B;">Parser</span> <span style="color: #ECBE7B;">Int</span>
<span style="color: #c678dd;">hour</span> <span style="color: #dcaeea;">=</span> check <span style="color: #98be65;">"Hour"</span> (range <span style="color: #da8548; font-weight: bold;">0</span> <span style="color: #da8548; font-weight: bold;">23</span>) <span style="color: #dcaeea;">$</span> digit <span style="color: #dcaeea;">&lt;#&gt;</span> <span style="color: #da8548; font-weight: bold;">2</span>

<span style="color: #c678dd;">minute</span> <span style="color: #dcaeea;">::</span> <span style="color: #ECBE7B;">Parser</span> <span style="color: #ECBE7B;">Int</span>
<span style="color: #c678dd;">minute</span> <span style="color: #dcaeea;">=</span> check <span style="color: #98be65;">"Minute"</span> (range <span style="color: #da8548; font-weight: bold;">0</span> <span style="color: #da8548; font-weight: bold;">59</span>) <span style="color: #dcaeea;">$</span> digit <span style="color: #dcaeea;">&lt;#&gt;</span> <span style="color: #da8548; font-weight: bold;">2</span>

<span style="color: #c678dd;">second</span> <span style="color: #dcaeea;">::</span> <span style="color: #ECBE7B;">Parser</span> <span style="color: #ECBE7B;">Int</span>
<span style="color: #c678dd;">second</span> <span style="color: #dcaeea;">=</span> check <span style="color: #98be65;">"Second"</span> (range <span style="color: #da8548; font-weight: bold;">0</span> <span style="color: #da8548; font-weight: bold;">59</span>) <span style="color: #dcaeea;">$</span> digit <span style="color: #dcaeea;">&lt;#&gt;</span> <span style="color: #da8548; font-weight: bold;">2</span>
</pre>
</div>


</section>
<section id="slide-2-4">
<h3 id="2-4"><span class="section-number-3">2.4.</span> Dates</h3>
<div class="org-src-container">

<pre class="src src-haskell">
<span style="color: #c678dd;">date</span> <span style="color: #dcaeea;">::</span> <span style="color: #ECBE7B;">Parser</span> <span style="color: #ECBE7B;">Day</span>
<span style="color: #c678dd;">date</span> <span style="color: #dcaeea;">=</span> fromGregorian
   <span style="color: #dcaeea;">&lt;$&gt;</span> year <span style="color: #dcaeea;">&lt;*&gt;</span> within dash month <span style="color: #dcaeea;">&lt;*&gt;</span> day


<span style="color: #c678dd;">time</span> <span style="color: #dcaeea;">::</span> <span style="color: #ECBE7B;">Parser</span> <span style="color: #ECBE7B;">TimeOfDay</span>
<span style="color: #c678dd;">time</span> <span style="color: #dcaeea;">=</span> <span style="color: #51afef;">do</span> h <span style="color: #dcaeea;">&lt;-</span> hour
          m <span style="color: #dcaeea;">&lt;-</span> colon <span style="color: #dcaeea;">*&gt;</span> minute
          s <span style="color: #dcaeea;">&lt;-</span> colon <span style="color: #dcaeea;">*&gt;</span> second
          decimals <span style="color: #dcaeea;">&lt;-</span> fromMaybe <span style="color: #da8548; font-weight: bold;">0</span> <span style="color: #dcaeea;">&lt;$&gt;</span> ((colon <span style="color: #dcaeea;">*&gt;</span> secondDecimals) <span style="color: #dcaeea;">|?</span>)
          pure <span style="color: #dcaeea;">$</span> <span style="color: #ECBE7B;">TimeOfDay</span> h m <span style="color: #dcaeea;">$</span> read (show s <span style="color: #dcaeea;">&lt;&gt;</span> <span style="color: #98be65;">"."</span> <span style="color: #dcaeea;">&lt;&gt;</span> show decimals)


<span style="color: #c678dd;">localDateTime</span> <span style="color: #dcaeea;">::</span> <span style="color: #ECBE7B;">Parser</span> <span style="color: #ECBE7B;">LocalTime</span>
<span style="color: #c678dd;">localDateTime</span> <span style="color: #dcaeea;">=</span> <span style="color: #ECBE7B;">LocalTime</span>
     <span style="color: #dcaeea;">&lt;$&gt;</span> (date <span style="color: #dcaeea;">&lt;*</span> oneOf [<span style="color: #98be65;">'T'</span>, <span style="color: #98be65;">'t'</span>]) <span style="color: #dcaeea;">&lt;*&gt;</span> time
</pre>
</div>

</section>
<section id="slide-2-5">
<h3 id="2-5"><span class="section-number-3">2.5.</span> Collections</h3>
<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #c678dd;">listOf</span> <span style="color: #dcaeea;">::</span> <span style="color: #ECBE7B;">Parser</span> a <span style="color: #dcaeea;">-&gt;</span> <span style="color: #ECBE7B;">Parser</span> [a]

<span style="color: #c678dd;">tupleOf</span> <span style="color: #dcaeea;">::</span> <span style="color: #ECBE7B;">Parser</span> a <span style="color: #dcaeea;">-&gt;</span> <span style="color: #ECBE7B;">Parser</span> [a]

<span style="color: #c678dd;">mapOf</span> <span style="color: #dcaeea;">::</span> <span style="color: #ECBE7B;">Ord</span> b <span style="color: #dcaeea;">=&gt;</span> <span style="color: #ECBE7B;">Parser</span> sep <span style="color: #dcaeea;">-&gt;</span> <span style="color: #ECBE7B;">Parser</span> k <span style="color: #dcaeea;">-&gt;</span> <span style="color: #ECBE7B;">Parser</span> v <span style="color: #dcaeea;">-&gt;</span> <span style="color: #ECBE7B;">Parser</span> (<span style="color: #ECBE7B;">Map</span> k v)
</pre>
</div>


</section>
</section>
<section>
<section id="slide-3">
<h2 id="3"><span class="section-number-2">3.</span> Example : JSON parser</h2>
<div class="outline-text-2" id="text-3">
</div>
</section>
<section id="slide-3-1">
<h3 id="3-1"><span class="section-number-3">3.1.</span> JSON Syntax Tree</h3>
<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #51afef;">data</span> <span style="color: #ECBE7B;">JsExpression</span>
  <span style="color: #dcaeea;">=</span> <span style="color: #ECBE7B;">JsNull</span>
  <span style="color: #dcaeea;">|</span> <span style="color: #ECBE7B;">JsNumber</span> <span style="color: #ECBE7B;">Double</span>
  <span style="color: #dcaeea;">|</span> <span style="color: #ECBE7B;">JsBool</span> <span style="color: #ECBE7B;">Bool</span>
  <span style="color: #dcaeea;">|</span> <span style="color: #ECBE7B;">JsString</span> <span style="color: #ECBE7B;">String</span>
  <span style="color: #dcaeea;">|</span> <span style="color: #ECBE7B;">JsArray</span> [<span style="color: #ECBE7B;">JsExpression</span>]
  <span style="color: #dcaeea;">|</span> <span style="color: #ECBE7B;">JsObject</span> (<span style="color: #ECBE7B;">Map</span> <span style="color: #ECBE7B;">String</span> <span style="color: #ECBE7B;">JsExpression</span>)
  <span style="color: #51afef;">deriving</span> (<span style="color: #ECBE7B;">Eq</span>, <span style="color: #ECBE7B;">Ord</span>)
</pre>
</div>

</section>
<section id="slide-3-2">
<h3 id="3-2"><span class="section-number-3">3.2.</span> JSON Elements</h3>
<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #c678dd;">nil</span> <span style="color: #dcaeea;">::</span> <span style="color: #ECBE7B;">Parser</span> <span style="color: #ECBE7B;">JsExpression</span>
<span style="color: #c678dd;">nil</span> <span style="color: #dcaeea;">=</span> <span style="color: #ECBE7B;">JsNull</span> <span style="color: #dcaeea;">&lt;$</span> is <span style="color: #98be65;">"null"</span>

<span style="color: #c678dd;">number</span> <span style="color: #dcaeea;">::</span> <span style="color: #ECBE7B;">Parser</span> <span style="color: #ECBE7B;">JsExpression</span>
<span style="color: #c678dd;">number</span> <span style="color: #dcaeea;">=</span> <span style="color: #ECBE7B;">JsNumber</span> <span style="color: #dcaeea;">&lt;$&gt;</span> double


<span style="color: #c678dd;">bool</span> <span style="color: #dcaeea;">::</span> <span style="color: #ECBE7B;">Parser</span> <span style="color: #ECBE7B;">JsExpression</span>
<span style="color: #c678dd;">bool</span> <span style="color: #dcaeea;">=</span> <span style="color: #ECBE7B;">JsBool</span> <span style="color: #dcaeea;">&lt;$&gt;</span> (<span style="color: #ECBE7B;">True</span>  <span style="color: #dcaeea;">&lt;$</span> is <span style="color: #98be65;">"true"</span> <span style="color: #dcaeea;">&lt;|&gt;</span>
                   <span style="color: #ECBE7B;">False</span> <span style="color: #dcaeea;">&lt;$</span> is <span style="color: #98be65;">"false"</span>)

<span style="color: #c678dd;">string</span> <span style="color: #dcaeea;">::</span> <span style="color: #ECBE7B;">Parser</span> <span style="color: #ECBE7B;">JsExpression</span>
<span style="color: #c678dd;">string</span> <span style="color: #dcaeea;">=</span> <span style="color: #ECBE7B;">JsString</span> <span style="color: #dcaeea;">&lt;$&gt;</span> text
  <span style="color: #51afef;">where</span>
    text <span style="color: #dcaeea;">=</span> withinDoubleQuotes (inverse doubleQuote <span style="color: #dcaeea;">|*</span>)
</pre>
</div>


<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #c678dd;">element</span> <span style="color: #dcaeea;">::</span> <span style="color: #ECBE7B;">Parser</span> <span style="color: #ECBE7B;">JsExpression</span>
<span style="color: #c678dd;">element</span> <span style="color: #dcaeea;">=</span> number <span style="color: #dcaeea;">&lt;|&gt;</span> bool <span style="color: #dcaeea;">&lt;|&gt;</span> nil <span style="color: #dcaeea;">&lt;|&gt;</span> string
</pre>
</div>

</section>
<section id="slide-3-3">
<h3 id="3-3"><span class="section-number-3">3.3.</span> Json Containers</h3>
<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #c678dd;">array</span> <span style="color: #dcaeea;">::</span> <span style="color: #ECBE7B;">Parser</span> <span style="color: #ECBE7B;">JsExpression</span>
<span style="color: #c678dd;">array</span> <span style="color: #dcaeea;">=</span> <span style="color: #ECBE7B;">JsArray</span> <span style="color: #dcaeea;">&lt;$&gt;</span> listOf json

<span style="color: #c678dd;">object</span> <span style="color: #dcaeea;">::</span> <span style="color: #ECBE7B;">Parser</span> <span style="color: #ECBE7B;">JsExpression</span>
<span style="color: #c678dd;">object</span> <span style="color: #dcaeea;">=</span> <span style="color: #ECBE7B;">JsObject</span> <span style="color: #dcaeea;">&lt;$&gt;</span> mapOf colon text json
</pre>
</div>


<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #c678dd;">container</span> <span style="color: #dcaeea;">::</span> <span style="color: #ECBE7B;">Parser</span> <span style="color: #ECBE7B;">JsExpression</span>
<span style="color: #c678dd;">container</span> <span style="color: #dcaeea;">=</span> array <span style="color: #dcaeea;">&lt;|&gt;</span> object
</pre>
</div>

</section>
<section id="slide-3-4">
<h3 id="3-4"><span class="section-number-3">3.4.</span> Json parser</h3>
<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #c678dd;">json</span> <span style="color: #dcaeea;">::</span> <span style="color: #ECBE7B;">Parser</span> <span style="color: #ECBE7B;">JsExpression</span>
<span style="color: #c678dd;">json</span> <span style="color: #dcaeea;">=</span> maybeWithin spacing jsValue
  <span style="color: #51afef;">where</span>
    jsValue <span style="color: #dcaeea;">=</span> element <span style="color: #dcaeea;">&lt;|&gt;</span> container
</pre>
</div>
</section>
</section>
</div>
</div>
<script src="/Users/alberto/.emacs.d/.local/straight/build-28.1/revealjs/dist/reveal.js"></script>
<script src="/Users/alberto/.emacs.d/.local/straight/build-28.1/revealjs/plugin/markdown/markdown.js"></script>
<script src="/Users/alberto/.emacs.d/.local/straight/build-28.1/revealjs/plugin/notes/notes.js"></script>
<script src="/Users/alberto/.emacs.d/.local/straight/build-28.1/revealjs/plugin/search/search.js"></script>
<script src="/Users/alberto/.emacs.d/.local/straight/build-28.1/revealjs/plugin/zoom/zoom.js"></script>
<script>
// Full list of configuration options available here:
// https://github.com/hakimel/reveal.js#configuration
Reveal.initialize({

controls: true,
progress: true,
history: false,
center: true,
slideNumber: 'c',
rollingLinks: false,
keyboard: true,
mouseWheel: false,
fragmentInURL: false,
hashOneBasedIndex: false,
pdfSeparateFragments: true,
overview: true,

transition: 'convex',
transitionSpeed: 'default',

// Plugins with reveal.js 4.x
plugins: [ RevealMarkdown, RevealNotes, RevealSearch, RevealZoom ],

// Optional libraries used to extend reveal.js
dependencies: [
]

});
</script>
</body>
</html>
